IDEA StatiCa Open Model
ReinforcementGroup.EndsTypeBeg Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 End type of the beginning of reinforcement bar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public LongReinfEndType EndsTypeBeg { get; set; }
Public Property EndsTypeBeg As LongReinfEndType
	Get
	Set
public:
property LongReinfEndType EndsTypeBeg {
	LongReinfEndType get ();
	void set (LongReinfEndType value);
}
Property Value
Type: LongReinfEndType
See Also
Reference
ReinforcementGroup Class
IdeaRS.OpenModel.Detail Namespace